# by luffycity.com
# 1.早上不要讲太久汤
# 2.课上内容太多
    # 2天 正则1天 其他常用模块1天
    # 前端 : html css js jq
    # 5个月
    # 1个月
    # 项目 2周一个项目

# 1.你的进度
# 2.后面的内容 对你的要求

# 讲了一个问题 留这个问题的作业
#   1.变复杂一点
#   2.20天 简单的知识点 变成大块的知识点了

# 1.进度的快慢 - 一起调整
# 2.作业 - 综合性越来越强 知识点会越来越多
# 3.关于写作业和解决问题 : 1.百度查 2.问同学 3.自己敲一敲
#   想办法解决你答题的效率 做题的效率

# os 和操作系统交互
# 文件夹和文件的处理 :创建文件夹 删除文件夹 重命名文件 删除文件 listdir stat
# 路径的处理 : 路径的拼接/拆分 计算大小 判断目录是否存在/是文件/是文件夹 绝对路径相关
# 执行操作系统命令 : 和执行路径相关 执行命令的

# 序列化模块 json/pickle
# dump/load 文件中 <-> 其他数据类型  文件中 <-> 字符串/字节 <-> 其他数据类型
# dumps/loads 字符串/字节 <-> 其他数据类型
# json 通用的/支持的数据类型少
# pickle python专用的/支持几乎所有数据类型

